## Plan Result (prod-enterprise)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 69 to add, 0 to change, 69 to destroy.</code></pre>

* Replace
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CNP-QA&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Functional Testing&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Pre-Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Pilot&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform System Integration Testing&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.subscription["CRIME-ADO-POC"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/ef8dd153-3fba-47a4-be65-15775bcde240/providers/Microsoft.Authorization/roleAssignments/be1cdc3b-e21f-2df0-98e3-1df83d8f141a" -> (known after apply)
      ~ name                             = "be1cdc3b-e21f-2df0-98e3-1df83d8f141a" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ef8dd153-3fba-47a4-be65-15775bcde240/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-AWS-Migration"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/58a2ce36-4e09-467b-8330-d164aa559c68/providers/Microsoft.Authorization/roleAssignments/9cd362ed-8ccc-50d5-22ec-4b58ead4e89b" -> (known after apply)
      ~ name                             = "9cd362ed-8ccc-50d5-22ec-4b58ead4e89b" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/58a2ce36-4e09-467b-8330-d164aa559c68/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFT-Idam-Dev"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/ddd45636-d58a-437f-8ad8-99b0add0092b/providers/Microsoft.Authorization/roleAssignments/36428a91-75fd-4f10-af75-f894fb5c9d6a" -> (known after apply)
      ~ name                             = "36428a91-75fd-4f10-af75-f894fb5c9d6a" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ddd45636-d58a-437f-8ad8-99b0add0092b/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFT-Sandbox"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/providers/Microsoft.Authorization/roleAssignments/ff11e937-4797-1bb7-2fd6-cd4a93176ac1" -> (known after apply)
      ~ name                             = "ff11e937-4797-1bb7-2fd6-cd4a93176ac1" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFT-VH-Pilot"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/4bb049c8-33f3-4860-91b4-9ee45375cc18/providers/Microsoft.Authorization/roleAssignments/b965faf2-0ca4-3582-6a40-f3e9f5b8fb5d" -> (known after apply)
      ~ name                             = "b965faf2-0ca4-3582-6a40-f3e9f5b8fb5d" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/4bb049c8-33f3-4860-91b4-9ee45375cc18/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-DEMO"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/providers/Microsoft.Authorization/roleAssignments/616b638a-1294-c5b1-24d5-c67be2198669" -> (known after apply)
      ~ name                             = "616b638a-1294-c5b1-24d5-c67be2198669" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-DEV"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/providers/Microsoft.Authorization/roleAssignments/4a063471-78c7-0496-8dbd-157b516fe416" -> (known after apply)
      ~ name                             = "4a063471-78c7-0496-8dbd-157b516fe416" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-ITHC"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/providers/Microsoft.Authorization/roleAssignments/247f71cd-c9c6-d648-ff94-a54d3ec33198" -> (known after apply)
      ~ name                             = "247f71cd-c9c6-d648-ff94-a54d3ec33198" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/providers/Microsoft.Authorization/roleAssignments/d56fca2b-db7c-7f05-bd96-e784309f9d4d" -> (known after apply)
      ~ name                             = "d56fca2b-db7c-7f05-bd96-e784309f9d4d" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleAssignments/5af1748f-2188-62cf-e46a-eb77542cec2b" -> (known after apply)
      ~ name                             = "5af1748f-2188-62cf-e46a-eb77542cec2b" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-STG"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/providers/Microsoft.Authorization/roleAssignments/ce6f261e-c93b-ebc0-0ca5-ee6b6582d1d1" -> (known after apply)
      ~ name                             = "ce6f261e-c93b-ebc0-0ca5-ee6b6582d1d1" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-TEST"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/providers/Microsoft.Authorization/roleAssignments/3ee5181e-d94b-df30-0638-c6d41bffaafe" -> (known after apply)
      ~ name                             = "3ee5181e-d94b-df30-0638-c6d41bffaafe" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPSDATA-DEMO"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/dbd3a97b-580e-4ecb-9ed3-4e86f6f23d25/providers/Microsoft.Authorization/roleAssignments/8e89276f-b5b7-f13d-e287-af3698ccce6d" -> (known after apply)
      ~ name                             = "8e89276f-b5b7-f13d-e287-af3698ccce6d" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/dbd3a97b-580e-4ecb-9ed3-4e86f6f23d25/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CNP-DEV"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleAssignments/c12c40bf-5e98-d985-9511-c8b905633aa7" -> (known after apply)
      ~ name                             = "c12c40bf-5e98-d985-9511-c8b905633aa7" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CNP-Prod"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleAssignments/46ebb120-887a-e074-8790-3c3156022ad0" -> (known after apply)
      ~ name                             = "46ebb120-887a-e074-8790-3c3156022ad0" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CNP-QA"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/providers/Microsoft.Authorization/roleAssignments/98e58cf9-d09e-68b6-7c3b-44545b527f7f" -> (known after apply)
      ~ name                             = "98e58cf9-d09e-68b6-7c3b-44545b527f7f" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-MI-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/0c1744f8-9e63-4742-9c28-c066fd2e6eee/providers/Microsoft.Authorization/roleAssignments/f6766d86-57d3-3767-fa1b-3fec57378d09" -> (known after apply)
      ~ name                             = "f6766d86-57d3-3767-fa1b-3fec57378d09" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/0c1744f8-9e63-4742-9c28-c066fd2e6eee/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-RDO-Development"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/fa397675-6ddf-4cb0-b1fc-bc7df0e51bf4/providers/Microsoft.Authorization/roleAssignments/837cd7d1-5031-6144-e50a-7c60cb1f2c78" -> (known after apply)
      ~ name                             = "837cd7d1-5031-6144-e50a-7c60cb1f2c78" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id         

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/2307d175-7e49-434b-9ac2-515529b845f2/providers/Microsoft.Authorization/roleAssignments/8d9470dc-46e6-c4ad-6908-9598a4b6ec45" -> (known after apply)
      ~ name                             = "8d9470dc-46e6-c4ad-6908-9598a4b6ec45" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/2307d175-7e49-434b-9ac2-515529b845f2/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MOJ DCD Atlassian LVE"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/providers/Microsoft.Authorization/roleAssignments/7174df79-1a4c-b84a-8e6b-71dae5793098" -> (known after apply)
      ~ name                             = "7174df79-1a4c-b84a-8e6b-71dae5793098" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MOJ DCD Atlassian NLE"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/providers/Microsoft.Authorization/roleAssignments/5021f979-048b-3a8f-52b6-1cf7acbd468b" -> (known after apply)
      ~ name                             = "5021f979-048b-3a8f-52b6-1cf7acbd468b" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Non-Functional Testing"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/274541e0-1d81-4466-82af-15cd40e86c96/providers/Microsoft.Authorization/roleAssignments/aabf915e-7272-8e48-48c1-7d99f984f5df" -> (known after apply)
      ~ name                             = "aabf915e-7272-8e48-48c1-7d99f984f5df" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/274541e0-1d81-4466-82af-15cd40e86c96/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Non-Live Management"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/66cfcc0b-d764-4c07-bbeb-0a74101dbcf3/providers/Microsoft.Authorization/roleAssignments/6e6b94fa-8303-7b85-e19b-ef86bd00dbcf" -> (known after apply)
      ~ name                             = "6e6b94fa-8303-7b85-e19b-ef86bd00dbcf" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/66cfcc0b-d764-4c07-bbeb-0a74101dbcf3/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Online Plea Pre-Production"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/e854024f-5d34-4043-a7a7-cbf4bb6f4d67/providers/Microsoft.Authorization/roleAssignments/81701701-dddd-5260-d987-b03a95ed0643" -> (known after apply)
      ~ name                             = "81701701-dddd-5260-d987-b03a95ed0643" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/e854024f-5d34-4043-a7a7-cbf4bb6f4d67/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Online Plea Production"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/5ff94e9e-4276-4e4b-b36b-475101d613d4/providers/Microsoft.Authorization/roleAssignments/30029d5e-4469-896d-40a3-51e3a9557751" -> (known after apply)
      ~ name                             = "30029d5e-4469-896d-40a3-51e3a9557751" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/5ff94e9e-4276-4e4b-b36b-475101d613d4/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Operational Services"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/28d33a47-7c14-456d-9a40-ce9c9b5a3937/providers/Microsoft.Authorization/roleAssignments/c0fc2127-3bd0-94ac-7683-b595619cd64d" -> (known after apply)
      ~ name                             = "c0fc2127-3bd0-94ac-7683-b595619cd64d" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/28d33a47-7c14-456d-9a40-ce9c9b5a3937/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Pilot"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/4c335e3a-f3d5-41cb-91d5-f2816853a22a/providers/Microsoft.Authorization/roleAssignments/f05362c0-e3e6-fb2b-1912-4572c5751592" -> (known after apply)
      ~ name                             = "f05362c0-e3e6-fb2b-1912-4572c5751592" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/4c335e3a-f3d5-41cb-91d5-f2816853a22a/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Pre-Production"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/3d84f717-22a0-4f4e-aac7-5ff8f4ee0a90/providers/Microsoft.Authorization/roleAssignments/7541542c-0763-e6ff-f7c7-293b1d86901d" -> (known after apply)
      ~ name                             = "7541542c-0763-e6ff-f7c7-293b1d86901d" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/3d84f717-22a0-4f4e-aac7-5ff8f4ee0a90/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Production"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/55c2f45e-1381-4b17-9bd0-f85215b8bb4f/providers/Microsoft.Authorization/roleAssignments/290979c6-3b80-c41f-30bf-96c4408b961b" -> (known after apply)
      ~ name                             = "290979c6-3b80-c41f-30bf-96c4408b961b" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/55c2f45e-1381-4b17-9bd0-f85215b8bb4f/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Security Operations"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/c7d20737-15ae-45da-bec4-67da9c029ddc/providers/Microsoft.Authorization/roleAssignments/f490d4a9-5fb2-035e-3c0f-1bd9e333856f" -> (known after apply)
      ~ name                             = "f490d4a9-5fb2-035e-3c0f-1bd9e333856f" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/c7d20737-15ae-45da-bec4-67da9c029ddc/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform System Integration Testing"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/12ffc6f5-7035-41fc-b96a-846d8fedc94b/providers/Microsoft.Authorization/roleAssignments/b5f2d35c-1761-62e6-ea5c-edfdef073e4e" -> (known after apply)
      ~ name                             = "b5f2d35c-1761-62e6-ea5c-edfdef073e4e" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/12ffc6f5-7035-41fc-b96a-846d8fedc94b/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Operational Services Validation"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/6491a35d-b1cc-4823-8340-0b847abc9a1b/providers/Microsoft.Authorization/roleAssignments/9ae2f77c-a4c5-ddde-21cc-b1b67a24c38d" -> (known after apply)
      ~ name                             = "9ae2f77c-a4c5-ddde-21cc-b1b67a24c38d" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/6491a35d-b1cc-4823-8340-0b847abc9a1b/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/abe4bc04-16e5-42dd-9aad-464f70ebc2ce/providers/Microsoft.Authorization/roleAssignments/864200c1-14c5-9b5b-71cf-956d16b21286" -> (known after apply)
      ~ name                             = "864200c1-14c5-9b5b-71cf-956d16b21286" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/abe4bc04-16e5-42dd-9aad-464f70ebc2ce/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleAssignments/aa920b91-c3e8-d98e-0841-05725d99e4ff" -> (known after apply)
      ~ name                             = "aa920b91-c3e8-d98e-0841-05725d99e4ff" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/705b2731-0e0b-4df7-8630-95f157f0a347/providers/Microsoft.Authorization/roleAssignments/822db439-50ea-c308-40ec-aff94a915ebe" -> (known after apply)
      ~ name                             = "822db439-50ea-c308-40ec-aff94a915ebe" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/705b2731-0e0b-4df7-8630-95f157f0a347/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 69 to add, 0 to change, 69 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":77,"Program":"tfcmt","SHA1":"","Target":"prod-enterprise","Vars":{}} -->